Tekla Open API Reference for Tekla Structures 2025
Hideable.HideFromDrawing Method
 Hides this object from the whole drawing. Calling Modify on the object is required to hide the object.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void HideFromDrawing()
Public Sub HideFromDrawing
See Also
Reference
Hideable Class
Tekla.Structures.Drawing Namespace